# ViewSolarstudySingledayFrameText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudySingledayFrameText Property
ParameterTypeId Class See Also
---
"Single day frame text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudySingledayFrameText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudySingledayFrameText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudySingledayFrameText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace